tremaru/tremaru.github.io/arduino-board-index/boards/trema-1.0.1/boards.txt

##############################################################
PiranhaUNO.name=Piranha UNO
PiranhaUNO.upload.tool=arduino:avrdude
PiranhaUNO.upload.protocol=arduino
PiranhaUNO.upload.maximum_size=32256
PiranhaUNO.upload.maximum_data_size=2048
PiranhaUNO.upload.speed=115200

PiranhaUNO.bootloader.tool=arduino:avrdude
PiranhaUNO.bootloader.low_fuses=0xFF
PiranhaUNO.bootloader.high_fuses=0xDE
PiranhaUNO.bootloader.extended_fuses=0xFD
PiranhaUNO.bootloader.unlock_bits=0x3F
PiranhaUNO.bootloader.lock_bits=0x0F
PiranhaUNO.bootloader.file=optiboot/optiboot_atmega328.hex

PiranhaUNO.build.mcu=atmega328p
PiranhaUNO.build.f_cpu=16000000L
PiranhaUNO.build.board=AVR_PiranhaUNO
PiranhaUNO.build.core=arduino:arduino
PiranhaUNO.build.variant=arduino:standard
PiranhaUNO.vid.0=0x0403
PiranhaUNO.pid.0=0x6015

##############################################################

PiranhaPRO.name=Piranha Pro Mini
PiranhaPRO.upload.tool=avrdude
PiranhaPRO.upload.protocol=arduino
PiranhaPRO.upload.maximum_size=32256
PiranhaPRO.upload.maximum_data_size=2048
PiranhaPRO.upload.speed=115200

PiranhaPRO.bootloader.tool=avrdude
PiranhaPRO.bootloader.low_fuses=0xff
PiranhaPRO.bootloader.unlock_bits=0x3F
PiranhaPRO.bootloader.lock_bits=0x0F
PiranhaPRO.menu.cpu.atmega328.bootloader.high_fuses=0xd8
PiranhaPRO.menu.cpu.atmega328.bootloader.extended_fuses=0xFD
PiranhaPRO.menu.cpu.atmega328.bootloader.file=optiboot/optiboot_atmega328-Mini.hex

PiranhaPRO.build.mcu=atmega328p
PiranhaPRO.build.f_cpu=16000000L
PiranhaPRO.build.board=AVR_PiranhaProMini
PiranhaPRO.build.core=arduino:arduino
PiranhaPRO.build.variant=arduino:standard

##############################################################

PiranhaUSBUART.name=Converter USB-UART (Piranha)
PiranhaUSBUART.vid.0=0x0403
PiranhaUSBUART.pid.0=0x6014

PiranhaUSBUART.upload.tool=avrdude
PiranhaUSBUART.upload.protocol=arduino
PiranhaUSBUART.upload.maximum_size=32256
PiranhaUSBUART.upload.maximum_data_size=2048
PiranhaUSBUART.upload.speed=115200

PiranhaUSBUART.bootloader.tool=avrdude
PiranhaUSBUART.bootloader.low_fuses=0xff
PiranhaUSBUART.bootloader.unlock_bits=0x3F
PiranhaUSBUART.bootloader.lock_bits=0x0F
PiranhaUSBUART.menu.cpu.atmega328.bootloader.high_fuses=0xd8
PiranhaUSBUART.menu.cpu.atmega328.bootloader.extended_fuses=0xFD
PiranhaUSBUART.menu.cpu.atmega328.bootloader.file=optiboot/optiboot_atmega328-Mini.hex

PiranhaUSBUART.build.mcu=atmega328p
PiranhaUSBUART.build.f_cpu=16000000L
PiranhaUSBUART.build.board=PiranhaUSBUART
PiranhaUSBUART.build.core=arduino:arduino
PiranhaUSBUART.build.variant=arduino:standard